OpenFOAM/libAcoustics-OF3.0.0/cases/cylinder2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    outlet
    {
        type            calculated;
    }

    open
    {
        type            slip;
    }

    cyl
    {
        type            calculated;
        value           uniform 0.0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
