OpenFOAM/libAcoustics-OF3.0.0/cases/cylinder2D/system/curleControl
CurleAnalogy1
{
	functionObjectLibs ("libAcousticsDev.so");
	
	type		Curle;
	
	log		true;
	
	order		second;
	
	probeFrequency	1;
	
	patchNames	(cyl);
	
	timeStart	0.001;
	
	timeEnd		1;
	
	c0		340;
	
	dRef		0.020833333;
	
	pName		p;
	
	rhoName		none;
	
	rhoRef		1.2;
	
	observers
	{
	    mic
	    {
		position	(0.0 2.432 0.0);
		pRef		2.0e-5;
		fftFreq		1024;
	    }
	}
}